<?php

namespace Database\Seeders;

use App\Models\Product;
use Illuminate\Database\Seeder;

class ProductSeeder extends Seeder
{
    public function run(){
        $products = [
            [
                'name' => 'Permanent Magnetic Bar',
                'description' => ' Magnetic Bar	มีลักษณะกลมเหมาะกับการใช้คัดแยกโลหะแบบผงหรือสนิมเหล็กได้ดี และมีเส้นแรงสนามแม่เหล็กอยู่ที่ 1,500-12,000 Gauss สามารถนำไปติดตั้งได้เกือบ ทุกจุดในระบบท่อลำเลียงหรือใน กระบวนการผลิต',
                'price' => null,
                'image' => 'Permanent Magnetic Bar.png',
            ],
            [
                'name' => 'Permanent Plate Magnet',
                'description' => 'ออกแบบมาใช้กับหน้างานที่เป็น Hopper เพื่อติดตั้งในรางหรือในกระบวนการลำเลียง ตำแหน่งที่แสดงมากที่สุดอยู่ภายใต้วัสดุลำเลียงแขวนลอยเหนือสายพานลำเลียง โดยแม่เหล็กชนิดนี้มีระยะดูดจับโลหะของแรงสนามแม่เหล็กถาวรมากกว่าชนิดแท่งกลม ขนาดแม่เหล็กสามารถออกแบบและติดตั้งหน้างานโดยไม่ให้มีผลกระทบต่อกระบวนการผลิตของท่านได้',
                'price' => null,
                'image' => 'Permanent Plate Magnet.jpg',
            ],
            [
                'name' => 'Permanent Grid magnet (แม่เหล็กถาวรแบบตะแกรง)',
                'description' => 'เป็นแม่เหล็กที่นำเอาแม่เหล็กถาวรชนิดแท่ง(Permanent Bar Magnet) มาประกอบเป็นทรงตะแกรง เพื่อเพิ่มประสิทธิภาพในการดูดจับ โดยกำหนดระยะห่างตามความเหมาะสม ให้ครอบคลุมทั้งรูปทรงท่อ และรูปทรงสี่เหลี่ยม สามารถทำได้ทั้งแบบมีปลอกเพื่อง่ายต่อการทำความสะอาดและแบบไม่มีปลอก ปัจจุบันค่าความหนาแน่นของสนามแม่เหล็กสูงสุด 12,000 + 500 gauss on surface	',
                'price' => null,
                'image' => 'Permanent Grid magnet.png',
            ],
            [
                'name' => 'Permanent Liquid Trap Magnet (แม่เหล็กถาวรแบบดักจับโลหะในของเหลว)',
                'description' => 'แม่เหล็กแบบดักจับโลหะในของเหลว เป็นการนำเอาแม่เหล็กแบบถาวรแท่งกลม มาประกอบร่วมกับโครงสร้าง โดยจะใช้ดักจับโลหะเหล็กที่ไหลผ่านภายในท่อกลม เหมาะกับผลิดภัณฑ์จำพวกของเหลวต่างๆ เช่น น้ำผลไม้ น้ำมันเครื่อง ซอสพริก เป็นต้น และค่าสนามแม่เหล็กถาวรอยู่ที่ 1,500-12.000 gauss จะจับสนิมเหล็กหรือ ผงเหล็กได้ดี การติดตั้งจะตัด-ต่อท่อ และยึดด้วย แคมรัด หรือหน้าแปลมาตรฐาน ขนาดของสินค้า ขึ้นอยู่กับขนาดของท่อของโรงงานลูกค้า สามารถออกแบบให้เหมาะสมกับผลิตภัณฑ์ของท่าน	',
                'price' => null,
                'image' => 'Permanent Liquid Trap Magnet.png',
            ],
            [
                'name' => 'Permanent Magnetic Grid in Housing (แม่เหล็กถาวรแบบตะแกรงพร้อมโครงสร้าง)',
                'description' => 'แม่เหล็กชนิดนี้ เป็นการนำแม่เหล็กถาวรแบบตะแกรง มาประกอบร่วมกับโครงสร้างรูปทรงกล่อง เพื่อง่ายในการนำไปตัดต่อเพิ่มเติมของหน้างาน เช่นหน้าแปลนแบบกลม หรือแบบสี่เหลี่ยม โดยให้สินค้า ไหลจากบนลงล่าง(Gravity Flow)ติดตั้งในแนวตั้งฉาก 90 องศาเท่านั้น สินค้าที่ไหลผ่านควรเป็น ผงแป้ง เม็ดข้าว น้ำตาล หรือกาแฟ เป็นต้น',
                'price' => null,
                'image' => 'Permanent Magnetic Grid in Housing.png',
            ],
        ];
    
        foreach ($products as $data) {
            Product::firstOrCreate(
                ['name' => $data['name']], // ป้องกันไม่ให้ซ้ำ
                $data
            );
        }
    }
 
    
}
